{
  "posts": [
    {
      "author": {
        "username": "Victor Bäck",
        "avatar": "https://cdn.dothq.co/avatars/a5c72203-1cc8-4bc6-badd-beafaad89bc1.webp?size=64"
      },
      "title": "Using the Dot Web API: Adding Dot to your application.",
      "body": "# Introduction\\nEver wanted to use one of those fancy APIs everyone is talking about? What even is an API? Well, we will be answering those questions in this very post.\\n## What is an API?\\nAn API according to Google is: *\"a set of functions and procedures allowing the creation of applications that access the features or data of an operating system, application, or other service.\"*\\n## Create files and folders\\nThe file explorer is accessible using the button in left corner of the navigation bar. You can create a new file by clicking the **New file** button in the file explorer. You can also create folders by clicking the **New folder** button.\\n## Switch to another file\\nAll your files and folders are presented as a tree in the file explorer. You can switch from one to another by clicking a file in the tree.\\n## Rename a file\\nYou can rename the current file by clicking the file name in the navigation bar or by clicking the **Rename** button in the file explorer.\\n## Delete a file\\nYou can delete the current file by clicking the **Remove** button in the file explorer. The file will be moved into the **Trash** folder and automatically deleted after 7 days of inactivity.\\n## Export a file\\nYou can export the current file by clicking **Export to disk** in the menu. You can choose to export the file as plain Markdown, as HTML using a Handlebars template or as a PDF.\\n# Synchronization\\nSynchronization is one of the biggest features of StackEdit. It enables you to synchronize any file in your workspace with other files stored in your **Google Drive**, your **Dropbox** and your **GitHub** accounts. This allows you to keep writing on other devices, collaborate with people you share the file with, integrate easily into your workflow... The synchronization mechanism takes place every minute in the background, downloading, merging, and uploading file modifications.\\nThere are two types of synchronization and they can complement each other:\\n- The workspace synchronization will sync all your files, folders and settings automatically. This will allow you to fetch your workspace on any other device.\\n\t> To start syncing your workspace, just sign in with Google in the menu.\\n- The file synchronization will keep one file of the workspace synced with one or multiple files in **Google Drive**, **Dropbox** or **GitHub**.\\n\t> Before starting to sync files, you must link an account in the **Synchronize** sub-menu.",
      "banner": "https://cdn.dothq.co/banners/1ed3daff-e724-420d-b9c6-5219a17935c2.jpg?fs=true",
      "datePublished": 1581969574093,
      "postId": "fb26c0e3-265b-4172-8dab-02d4b5d4428a",
      "slug": "using-dot-web-api-adding-dot-to-your-application",
      "tag": "Developers",
      "attribution": "Photo by @lucabravo on Unsplash"
    },
    {
      "author": {
        "username": "Victor Bäck",
        "avatar": "https://cdn.dothq.co/avatars/a5c72203-1cc8-4bc6-badd-beafaad89bc1.webp?size=64"
      },
      "title": "Securing your passwords: How to stay safe online.",
      "body": "Test123",
      "banner": "https://cdn.dothq.co/banners/bc615427-8fef-4e8f-b9a7-9a9fd2a28e91.jpg?fs=true",
      "datePublished": 1581969666516,
      "postId": "7c206f02-c9fd-48e1-8829-6a4eefec405d",
      "slug": "staying-safe-online",
      "tag": "Privacy",
      "attribution": "Photo by @cbarbalis on Unsplash"
    }
  ],
  "count": 0,
  "users": []
}